/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   sort_5.c                                           :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: jkwak <jkwak@student.42seoul.kr>           +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/06/13 14:17:50 by jkwak             #+#    #+#             */
/*   Updated: 2022/06/13 16:33:00 by jkwak            ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "push_swap.h"

/*가장 작은 수를 b 스택으로.
가장 작은 수가 0, 1, 3, 4번째에 있는 경우의 수 나누기*/

void	check_and_sort_5(t_stack *a, t_stack *b)
{
	if (a->arr[a->count - 1] == 0)
	search_smallest();
}